app/controllers/features_controller.rb

INSERT INTO `features` (`created_at`, `deprecated`, `fv`, `info`, `language_id`, `name`, `snippet`, `tv`, `updated_at`, `url`) VALUES ('2010-08-25 06:34:33', 0, NULL, 'Prepares a query for later use with ifx_do().\r\n\r\nFor \"select-type\" queries a cursor is declared and opened. Non-select queries are \"execute immediate\".\r\n\r\nFor either query type the number of (estimated or real) affected rows is saved for retrieval by ifx_affected_rows().\r\n\r\nIf the contents of the TEXT (or BYTE) column allow it, you can also use ifx_textasvarchar(1) and ifx_byteasvarchar(1). This allows you to treat TEXT (or BYTE) columns just as if they were ordinary (but long) VARCHAR columns for select queries, and you don\'t need to bother with blob id\'s.\r\n\r\nWith ifx_textasvarchar(0) or ifx_byteasvarchar(0) (the default situation), select queries will return BLOB columns as blob id\'s (integer value). You can get the value of the blob as a string or file with the blob functions (see below).', 4, 'ifx_prepare', '$conn = fx_connect( \"db\", \"user\", \"password\" );\r\n$result = ifx_prepare(\"SELECT customer_num, company FROM customer\", $conn);\r\nifx_do($result);', NULL, '2010-08-25 06:34:33', 'http://us3.php.net/manual/en/function.ifx-prepare.php')
---
  def create
    @feature = Feature.new(params[:feature])
    @feature.lid = 0 # change this
    if @feature.save

SELECT `features`.* FROM `features` WHERE (`features`.`id` = 1) LIMIT 1
---
  def show
    @feature = Feature.find(params[:id])

SELECT `features`.* FROM `features` WHERE (features.name LIKE '%ifx%')
---
  def index
    @features = Feature.all

SELECT `features`.* FROM `features` WHERE (`features`.`id` = 1) LIMIT 1
---
  def edit
    @feature = Feature.find(params[:id])

SELECT `features`.* FROM `features` WHERE (`features`.`id` = 1) LIMIT 1
UPDATE `features` SET `info` = 'Prepares a query for later use with ifx_do(). <script>\r\n\r\nFor \"select-type\" queries a cursor is declared and opened. Non-select queries are \"execute immediate\".\r\n\r\nFor either query type the number of (estimated or real) affected rows is saved for retrieval by ifx_affected_rows().\r\n\r\nIf the contents of the TEXT (or BYTE) column allow it, you can also use ifx_textasvarchar(1) and ifx_byteasvarchar(1). This allows you to treat TEXT (or BYTE) columns just as if they were ordinary (but long) VARCHAR columns for select queries, and you don\'t need to bother with blob id\'s.\r\n\r\nWith ifx_textasvarchar(0) or ifx_byteasvarchar(0) (the default situation), select queries will return BLOB columns as blob id\'s (integer value). You can get the value of the blob as a string or file with the blob functions (see below).', `updated_at` = '2010-08-25 04:44:17' WHERE (`features`.`id` = 1)
---
  def update
    @feature = Feature.find(params[:id])
    if @feature.update_attributes(params[:feature])