app/views/features/_feature.html.erb

	<pre class="feature-snippet prettyprint linenums"><%= feature.snippet %></pre>
	<p>Edited <%= pluralize(feature.versions.size, 'time') %>.<%= " Last edit by #{feature.versions.last.whodunnit.gsub(/([0-9]+).([0-9]+).([0-9]+).([0-9]+)/, 'xxx.xxx.\3.\4')} on #{feature.versions.last.created_at.strftime("%m/%d/%Y at %I:%M%p")}." if feature.versions.size > 0 %></p>
---
SELECT COUNT(*) AS count_id FROM `versions` WHERE (`versions`.item_id = 1 AND `versions`.item_type = 'Feature')
SELECT `versions`.* FROM `versions` WHERE (`versions`.item_id = 1 AND `versions`.item_type = 'Feature') ORDER BY created_at DESC, id DESC LIMIT 1