app/views/features/_form.html.erb

SELECT `languages`.* FROM `languages`
---
	<%= f.label :language_id, 'Language', {:class => 'inline'} %>
	<%= collection_select :feature, :language_id, Language.all, :id, :name, {:prompt => true} %>